---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetCustomConstraints
source: html/d753c390-8d4c-5193-eef8-ec7b9e7bd875.htm
---
# Autodesk.Revit.DB.Structure.RebarUpdateCurvesData.GetCustomConstraints Method

Gets all rebar constraints that are attached to custom handles for this rebar.

## Syntax (C#)
```csharp
public IList<RebarConstraint> GetCustomConstraints()
```

## Returns
Returns all rebar constraints that are attached to custom handles for this rebar. This array does not contains the start and end constraints.